# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: Sasha Nazareth
#### Student ID: 3912063

Date: 17th August, 2022

Version: 3.0

Environment: Python 3 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment, e.g.,:
* pandas
* re
* numpy


## Introduction
Give general information of this assessment here, e.g., what problems you encounter in integration, general steps and solutions you've taken to integrate the data. 

<span style="color: red"> Note that this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. Note also that any generic comments written in this notebook are to be removed and replace with your own words.</span>

##  Import libraries

In [1]:
import pandas as pd
import numpy as np
import re

### 1. Examining and loading data

In [2]:
# Loading both the csv's and comparing them first

df1 = pd.read_csv('s3912063_dataset1_solution.csv')
df2 = pd.read_csv('s3912063_dataset2.csv')

In [3]:
df2

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE)
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Health,NaN,2012-01-08 12:00:00,SEC Recruitment,1.0
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering,Permanent,2013-08-07 12:00:00,Navartis Limited,1.0
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality,Permanent,2013-02-01 00:00:00,Pertemps,1.0
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Health,NaN,2013-07-26 15:00:00,Team 24 Ltd,1.0
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,Information Technology,NaN,2012-11-21 12:00:00,Matchtech,1.0
...,...,...,...,...,...,...,...,...,...
4995,Wirral,"Registered General Nurse Upton, Wirral",2028.00,2014-01-08 00:00:00,Health,NaN,2013-12-25 00:00:00,Time Recruitment Solutions Ltd,1.0
4996,South East London,2nd line support Technician Mac specialised,2625.00,2012-04-14 15:00:00,Information Technology,Permanent,2012-01-15 15:00:00,Amsys,1.0
4997,Boldon Colliery,Maintenance Control Engineer,3833.33,2013-06-11 12:00:00,Engineering,Permanent,2013-05-12 12:00:00,UKStaffsearch,1.0
4998,Hertfordshire,Pastry Sous Chef Top Hotel High Volume Pastr...,2250.00,2013-12-28 15:00:00,Hospitality,NaN,2013-11-28 15:00:00,Chef Results,1.0
4999,Reading,Bilingual Technical / Remote Support engineer/...,3041.67,2013-05-16 00:00:00,Information Technology,Permanent,2013-04-16 00:00:00,Global Technology Solutions Ltd,1.0

In [4]:
df2['Location'].value_counts()

UK                   753
London               660
South East London    248
The City             101
Manchester            75
                    ...
Melton Mowbray         1
Arundel                1
Gerrards Cross         1
Newton Abbot           1
Morpeth                1
Name: Location, Length: 431, dtype: int64

In [5]:
df2['Job Title'].value_counts()

Peripatetic / Relief Manager Nursing Homes London        1
Direct Reinsurance Technical Underwriting Assistant      1
WLAN Network Security Consultant                         1
Foundry Worker                                           1
Sales Relationship Manager                               1
                                                        ..
Accounts Junior (Part AAT Q)                             1
Customer Consultant                                      1
Brand New Office Opening  Sales and Customer Services    1
Senior Staff Nurse, HDU Lead  Dorchester                 1
Spa Therapists  Casual                                   1
Name: Job Title, Length: 5000, dtype: int64

In [6]:
# Displaying the two dataframes together to compare
print('S1:' + str(df1.shape))
display(df1.head())
print('S2:' + str(df2.shape))
display(df2.head())

S1:(50751, 11)

,Id,Title,Category,Open date,Close date,Company,ContractTime,ContractType,Location,Salary,Source
0,69001361,CHEF DE PARTIE M STAR COTSWOLDS ****K MANY BE...,Hospitality & Catering Jobs,2013-07-14 12:00:00,2013-09-12 12:00:00,Gladstone Park Limited,permanent,non-specified,Gloucestershire,17000.0,cv-library.co.uk
1,69540246,Sales Manager Flooring / Interior Furnishings,Sales Jobs,2012-10-08 00:00:00,2012-12-07 00:00:00,Mitchel Maguire,permanent,non-specified,Manchester,32500.0,cv-library.co.uk
2,71369140,Projects Engineer Mechanical Handling,Engineering Jobs,2012-05-14 00:00:00,2012-07-13 00:00:00,Doyen Resources Limited,permanent,non-specified,Gloucester,30000.0,cv-library.co.uk
3,70607805,Coded Welder / Fabricators,Engineering Jobs,2013-03-20 15:00:00,2013-04-19 15:00:00,ACER,contract,non-specified,Blackpool,26880.0,cv-library.co.uk
4,69750692,Events Coordinator Administration Support,"PR, Advertising & Marketing Jobs",2013-12-15 00:00:00,2014-02-13 00:00:00,AJ Chambers,permanent,non-specified,Basildon,22500.0,cv-library.co.uk

S2:(5000, 9)

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE)
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Health,NaN,2012-01-08 12:00:00,SEC Recruitment,1.0
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering,Permanent,2013-08-07 12:00:00,Navartis Limited,1.0
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality,Permanent,2013-02-01 00:00:00,Pertemps,1.0
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Health,NaN,2013-07-26 15:00:00,Team 24 Ltd,1.0
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,Information Technology,NaN,2012-11-21 12:00:00,Matchtech,1.0

In [7]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  object
 4   Close date    50751 non-null  object
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Closing                     5000 non-null   object
 4   Category                    5000 non-null   object
 5   Type                        3593 non-null   object
 6   Opening                     5000 non-null   object
 7   Organisation                4531 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   float64
dtypes: float64(2), object(7)
memory usage: 351.7+ KB
None

In [8]:
# firstly as there are null values I will replace the empty whitespaces with 'non- specified'

In [9]:
# I am stripping the column here because there are whitespaces in between, hence to fix this I use 
# the function strip

df2['Type'] = df2['Type'].str.strip()

In [10]:
df2['Type'] = df2['Type'].replace('', 'non-specified')

In [11]:
df2['Type'] = df2['Type'].replace(np.nan, 'non-specified')

In [12]:
df2["Type"].value_counts()

Permanent              3034
non-specified          1407
Fixed Term Contract     559
Name: Type, dtype: int64

In [13]:
# checking if nan is filled in correctly in the whitespaces
import math
count = 0
for element in df2['Type']:
    if pd.isnull(element):
        print("It is not a number", element)
        count += 1
print("How many errors?", count)

# there are 1407 erros which is 3593-5000, hence nan is filled correctly

How many errors? 0

In [14]:
#Using the same method

df2['Organisation'] = df2['Organisation'].str.strip()
df2['Organisation'] = df2['Organisation'].replace('', 'non- specified')
df2['Organisation'] = df2['Organisation'].replace(np.nan, 'non-specified')
df2["Organisation"].value_counts()

non-specified           469
UKStaffsearch            52
CVbrowser                34
Randstad                 30
Matchtech Group plc.     28
                       ...
Jesmond Dene House        1
URECRUIT.                 1
Adapt IT Recruitment      1
IC 3e                     1
Arqiva                    1
Name: Organisation, Length: 2473, dtype: int64

In [15]:
# checking if nan if filled in correctly in the whitespaces
import math
count = 0
for element in df2['Organisation']:
    if pd.isnull(element):
        print("It is not a number", element)
        count += 1
print("How many errors?", count)

# there are 469 erros which is 4531-5000, hence nan is filled correctly

How many errors? 0

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Closing                     5000 non-null   object
 4   Category                    5000 non-null   object
 5   Type                        5000 non-null   object
 6   Opening                     5000 non-null   object
 7   Organisation                5000 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   float64
dtypes: float64(2), object(7)
memory usage: 351.7+ KB

In [17]:
# checking if there are 8 categories as in df1

df2["Category"].value_counts()

Information Technology    1251
Health                     804
Engineering                732
Finance                    675
Sales                      517
Hospitality                436
Education                  341
Marketing                  244
Name: Category, dtype: int64

## Defining the initial global schema

### I will be mentioning the what I have observed below:

df1 is the dataset I have cleaned and df2 is the given dataset. 

1. There is no Id in df2 but there is in df1 hence, I will generate a Id for df2.
2. Job title in df2 is similar with df1 hence, no changes in that column.
3. Category is also mentioned in both but in df2 the categories are in a different way written which 
   will have to change according to df1.
4. Open date and close date is similar to df2 opening and closing columns, hence no change there.
5. Company in df1 and organisation in df2 are similar. Just in df2 as there are null values will have to change       it.
6. Contract time in df1 and full time equivalent in df2 are similar. In full time equivalent I will change 1 as 
   full time and the other four values i.e., 0.2, 0.4, 0.6 and 0.8 as part time.  
7. Contract type in df1 and type in df2 are similar. There are few missing values in type which I will change to
   non-specified.
8. Monthly payment in df2 will be converted into an annual salary as in df1.
9. I will add a source column in df2 as how source is mentioned in df1.

### I will be working towards this schema-

1. Id- A id for the job ads [int]
2. Title- which is the job title [string]
3. Category- there will be 8 categories [string]
4. Open date- in the yyyy-mm-dd hh:mm:ss format [datetime]
5. Close date- in the yyyy-mm-dd hh:mm:ss format [datetime]
6. Company- the name of the company [string]
7. Contract Time- whether the job is permanent, contract or non specified [string]
8. Contract Type- whether the job is part time, full time or non specified [string]
9. Location- the location of the job [string]
10. Salary- the annual salary [float]
11. Source- the main source where the job is listed [string]

### 2. Resolving schema conflicts
Give some general information about the conflicts you found in two schemas and steps you taken to resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: Monthly payment in df2
General information about this conflict

I will be converting monthly payment into a per annum salary as in df1
Therefore, i will be multiplying the monthly payment with 12 months which will give the year's salary

In [18]:


df2['Monthly Payment'] = df2['Monthly Payment'].apply(lambda x: x*12)

df2.rename(columns = {'Monthly Payment':'Salary'}, inplace = True)

df2['Salary'].head()

0    54999.96
1    33750.00
2    21500.04
3    35000.04
4    37500.00
Name: Salary, dtype: float64

#### Conflict 2: Category in df2

I will change the category names as mentioned in df1 as both mean the same but just the names are different

In [19]:
df2["Category"].value_counts()

Information Technology    1251
Health                     804
Engineering                732
Finance                    675
Sales                      517
Hospitality                436
Education                  341
Marketing                  244
Name: Category, dtype: int64

In [20]:
df1["Category"].value_counts()

IT Jobs                             13170
Healthcare & Nursing Jobs            8066
Engineering Jobs                     7517
Accounting & Finance Jobs            6771
Sales Jobs                           4869
Hospitality & Catering Jobs          4376
Teaching Jobs                        3456
PR, Advertising & Marketing Jobs     2526
Name: Category, dtype: int64

In [21]:
# I will be replacing the df2 categories with the df1 categories

In [22]:
df2['Category'] = df2['Category'].replace('Information Technology', 'IT Jobs')

In [23]:
df2['Category'] = df2['Category'].replace('Health', 'Healthcare & Nursing Jobs')

In [24]:
df2['Category'] = df2['Category'].replace('Engineering', 'Engineering Jobs')

In [25]:
df2['Category'] = df2['Category'].replace('Finance', 'Accounting & Finance Jobs')

In [26]:
df2['Category'] = df2['Category'].replace('Sales', 'Sales Jobs')

In [27]:
df2['Category'] = df2['Category'].replace('Hospitality', 'Hospitality & Catering Jobs')

In [28]:
df2['Category'] = df2['Category'].replace('Education', 'Teaching Jobs')

In [29]:
df2['Category'] = df2['Category'].replace('Marketing', 'PR, Advertising & Marketing Jobs')

In [30]:
df2["Category"].value_counts()

IT Jobs                             1251
Healthcare & Nursing Jobs            804
Engineering Jobs                     732
Accounting & Finance Jobs            675
Sales Jobs                           517
Hospitality & Catering Jobs          436
Teaching Jobs                        341
PR, Advertising & Marketing Jobs     244
Name: Category, dtype: int64

#### Conflict 3: Full- time equivalent(FTE) in df2 

I will change the FTE values i.e., the other four values i.e., 0.2,0.4,0.6 and 0.8 as part time. While 1 will change as full time.

In [31]:
df2["Full-Time Equivalent (FTE)"].value_counts()

1.0    4857
0.2      39
0.8      36
0.6      36
0.4      32
Name: Full-Time Equivalent (FTE), dtype: int64

In [32]:
# just cross checking what are the value names in df1
df1['ContractType'].value_counts()

non-specified    38069
full_time        11242
part_time         1440
Name: ContractType, dtype: int64

In [33]:
df2['Full-Time Equivalent (FTE)'] = df2['Full-Time Equivalent (FTE)'].replace(0.2, 'part_time')

In [34]:
df2['Full-Time Equivalent (FTE)'] = df2['Full-Time Equivalent (FTE)'].replace(0.8, 'part_time')

In [35]:
df2['Full-Time Equivalent (FTE)'] = df2['Full-Time Equivalent (FTE)'].replace(0.6, 'part_time')

In [36]:
df2['Full-Time Equivalent (FTE)'] = df2['Full-Time Equivalent (FTE)'].replace(0.4, 'part_time')

In [37]:
df2['Full-Time Equivalent (FTE)'] = df2['Full-Time Equivalent (FTE)'].replace(1.0, 'full_time')

In [38]:
df2["Full-Time Equivalent (FTE)"].value_counts()

full_time    4857
part_time     143
Name: Full-Time Equivalent (FTE), dtype: int64

#### Conflict 4: Adding a Source column in df2 

I will add a source column as sources are mentioned in df1. I know the source of these job adds as they are mentioned in the aassignment specifications.

In [39]:
df2['Source'] = "www.jobhuntlisting.com"

In [40]:
df2

,Location,Job Title,Salary,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),Source
0,Berkshire,Lead CRA UK,54999.96,2012-03-08 12:00:00,Healthcare & Nursing Jobs,non-specified,2012-01-08 12:00:00,SEC Recruitment,full_time,www.jobhuntlisting.com
1,Bristol,Possession Manager,33750.00,2013-09-06 12:00:00,Engineering Jobs,Permanent,2013-08-07 12:00:00,Navartis Limited,full_time,www.jobhuntlisting.com
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,21500.04,2013-05-02 00:00:00,Hospitality & Catering Jobs,Permanent,2013-02-01 00:00:00,Pertemps,full_time,www.jobhuntlisting.com
3,Poole,HEAD OF CARE (RGN/RMN) Poole,35000.04,2013-09-24 15:00:00,Healthcare & Nursing Jobs,non-specified,2013-07-26 15:00:00,Team 24 Ltd,full_time,www.jobhuntlisting.com
4,Woking,SQL Server DBA,37500.00,2012-12-21 12:00:00,IT Jobs,non-specified,2012-11-21 12:00:00,Matchtech,full_time,www.jobhuntlisting.com
...,...,...,...,...,...,...,...,...,...,...
4995,Wirral,"Registered General Nurse Upton, Wirral",24336.00,2014-01-08 00:00:00,Healthcare & Nursing Jobs,non-specified,2013-12-25 00:00:00,Time Recruitment Solutions Ltd,full_time,www.jobhuntlisting.com
4996,South East London,2nd line support Technician Mac specialised,31500.00,2012-04-14 15:00:00,IT Jobs,Permanent,2012-01-15 15:00:00,Amsys,full_time,www.jobhuntlisting.com
4997,Boldon Colliery,Maintenance Control Engineer,45999.96,2013-06-11 12:00:00,Engineering Jobs,Permanent,2013-05-12 12:00:00,UKStaffsearch,full_time,www.jobhuntlisting.com
4998,Hertfordshire,Pastry Sous Chef Top Hotel High Volume Pastr...,27000.00,2013-12-28 15:00:00,Hospitality & Catering Jobs,non-specified,2013-11-28 15:00:00,Chef Results,full_time,www.jobhuntlisting.com
4999,Reading,Bilingual Technical / Remote Support engineer/...,36500.04,2013-05-16 00:00:00,IT Jobs,Permanent,2013-04-16 00:00:00,Global Technology Solutions Ltd,full_time,www.jobhuntlisting.com

#### Conflict 5: Opening and closing in df2  and Open date and Close date in df1

I will check these two columns and correct the type as it has to be similar to the ones- 'Open date' and 'Close date' in df1

In [41]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   Closing                     5000 non-null   object
 4   Category                    5000 non-null   object
 5   Type                        5000 non-null   object
 6   Opening                     5000 non-null   object
 7   Organisation                5000 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   object
 9   Source                      5000 non-null   object
dtypes: float64(1), object(9)
memory usage: 390.8+ KB

In [42]:
df1.info()

# In the df1 info it is showing that open date and close date are not in date time format but before saving it into
# my csv i converted it, unfortunately it turns it back to a string so will just again convert both of them
# into date time format

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  object
 4   Close date    50751 non-null  object
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB

In [43]:
df1['Open date'] = pd.to_datetime(df1['Open date'])

In [44]:
df1['Close date'] = pd.to_datetime(df1['Close date'])

In [45]:
df2['Opening'] = pd.to_datetime(df2['Opening'])

In [46]:
df2['Closing'] = pd.to_datetime(df2['Closing'])

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  datetime64[ns]
 4   Close date    50751 non-null  datetime64[ns]
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB

In [48]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   Closing                     5000 non-null   datetime64[ns]
 4   Category                    5000 non-null   object
 5   Type                        5000 non-null   object
 6   Opening                     5000 non-null   datetime64[ns]
 7   Organisation                5000 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   object
 9   Source                      5000 non-null   object
dtypes: datetime64[ns](2), float64(1), object(7)
memory usage: 390.8+ KB

#### Conflict 6: Creating a Id column in df2  

I will create a id for the job ads in df2 as in df1 all have ids

In [49]:
# I am creating a simple id as when I tried creating a unique id the values were even coming in negatives, hence
# this was the best way 

df2["Id"] = df2.index + 1

In [50]:
df2

,Location,Job Title,Salary,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),Source,Id
0,Berkshire,Lead CRA UK,54999.96,2012-03-08 12:00:00,Healthcare & Nursing Jobs,non-specified,2012-01-08 12:00:00,SEC Recruitment,full_time,www.jobhuntlisting.com,1
1,Bristol,Possession Manager,33750.00,2013-09-06 12:00:00,Engineering Jobs,Permanent,2013-08-07 12:00:00,Navartis Limited,full_time,www.jobhuntlisting.com,2
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,21500.04,2013-05-02 00:00:00,Hospitality & Catering Jobs,Permanent,2013-02-01 00:00:00,Pertemps,full_time,www.jobhuntlisting.com,3
3,Poole,HEAD OF CARE (RGN/RMN) Poole,35000.04,2013-09-24 15:00:00,Healthcare & Nursing Jobs,non-specified,2013-07-26 15:00:00,Team 24 Ltd,full_time,www.jobhuntlisting.com,4
4,Woking,SQL Server DBA,37500.00,2012-12-21 12:00:00,IT Jobs,non-specified,2012-11-21 12:00:00,Matchtech,full_time,www.jobhuntlisting.com,5
...,...,...,...,...,...,...,...,...,...,...,...
4995,Wirral,"Registered General Nurse Upton, Wirral",24336.00,2014-01-08 00:00:00,Healthcare & Nursing Jobs,non-specified,2013-12-25 00:00:00,Time Recruitment Solutions Ltd,full_time,www.jobhuntlisting.com,4996
4996,South East London,2nd line support Technician Mac specialised,31500.00,2012-04-14 15:00:00,IT Jobs,Permanent,2012-01-15 15:00:00,Amsys,full_time,www.jobhuntlisting.com,4997
4997,Boldon Colliery,Maintenance Control Engineer,45999.96,2013-06-11 12:00:00,Engineering Jobs,Permanent,2013-05-12 12:00:00,UKStaffsearch,full_time,www.jobhuntlisting.com,4998
4998,Hertfordshire,Pastry Sous Chef Top Hotel High Volume Pastr...,27000.00,2013-12-28 15:00:00,Hospitality & Catering Jobs,non-specified,2013-11-28 15:00:00,Chef Results,full_time,www.jobhuntlisting.com,4999
4999,Reading,Bilingual Technical / Remote Support engineer/...,36500.04,2013-05-16 00:00:00,IT Jobs,Permanent,2013-04-16 00:00:00,Global Technology Solutions Ltd,full_time,www.jobhuntlisting.com,5000

## Adapting the data types across both dataframes

I will make df2 consistent with df1

In [51]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  datetime64[ns]
 4   Close date    50751 non-null  datetime64[ns]
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   Closing                     5000 non-null   datetime64[ns]
 4   Category                    5000 non-null   object
 5   Type                        5000 non-null   object
 6   Opening                     5000 non-null   datetime64[ns]
 7   Organisation                5000 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   object
 9   Source                      5000 non-null   object
 10  Id                          5000 non-null   int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 429.8+ KB
None

In [52]:
# the data types are consistent hence, no changes

In [53]:
# double checking
for y in [c for c in df1.columns if c in df2.columns]: # common columns
    if df1[y].dtype != df2[y].dtype:
        print ("Column " + y + "in df1: "+ str(df1[y].dtype) + "to" + str(df2[y].dtype))
        df1[y] = df1[y].astype(df2[y].dtype)

In [54]:
# all are consistent!

### Lastly, I will rename all df2 to df1 column names

In [55]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  datetime64[ns]
 4   Close date    50751 non-null  datetime64[ns]
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Salary                      5000 non-null   float64
 3   Closing                     5000 non-null   datetime64[ns]
 4   Category                    5000 non-null   object
 5   Type                        5000 non-null   object
 6   Opening                     5000 non-null   datetime64[ns]
 7   Organisation                5000 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   object
 9   Source                      5000 non-null   object
 10  Id                          5000 non-null   int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 429.8+ KB
None

In [56]:
df2.rename(columns={'Job Title': 'Title', 'Opening': 'Open date','Closing':'Close date','Organisation':'Company',
                   'Full-Time Equivalent (FTE)':'ContractTime','Type':'ContractType'}, inplace=True)

In [57]:
print (df1.info())
print (df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50751 entries, 0 to 50750
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50751 non-null  int64
 1   Title         50751 non-null  object
 2   Category      50751 non-null  object
 3   Open date     50751 non-null  datetime64[ns]
 4   Close date    50751 non-null  datetime64[ns]
 5   Company       50751 non-null  object
 6   ContractTime  50751 non-null  object
 7   ContractType  50751 non-null  object
 8   Location      50751 non-null  object
 9   Salary        50751 non-null  float64
 10  Source        50751 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Location      5000 non-null   object
 1   Title         5000 non-null   object
 2   Salary        5000 non-null   float64
 3   Close date    5000 non-null   datetime64[ns]
 4   Category      5000 non-null   object
 5   ContractType  5000 non-null   object
 6   Open date     5000 non-null   datetime64[ns]
 7   Company       5000 non-null   object
 8   ContractTime  5000 non-null   object
 9   Source        5000 non-null   object
 10  Id            5000 non-null   int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 429.8+ KB
None

### 3. Merging data

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [58]:
# Merging both the dataframes

final_df = pd.concat([df1,df2])
print (final_df.shape)
final_df

(55751, 11)

,Id,Title,Category,Open date,Close date,Company,ContractTime,ContractType,Location,Salary,Source
0,69001361,CHEF DE PARTIE M STAR COTSWOLDS ****K MANY BE...,Hospitality & Catering Jobs,2013-07-14 12:00:00,2013-09-12 12:00:00,Gladstone Park Limited,permanent,non-specified,Gloucestershire,17000.00,cv-library.co.uk
1,69540246,Sales Manager Flooring / Interior Furnishings,Sales Jobs,2012-10-08 00:00:00,2012-12-07 00:00:00,Mitchel Maguire,permanent,non-specified,Manchester,32500.00,cv-library.co.uk
2,71369140,Projects Engineer Mechanical Handling,Engineering Jobs,2012-05-14 00:00:00,2012-07-13 00:00:00,Doyen Resources Limited,permanent,non-specified,Gloucester,30000.00,cv-library.co.uk
3,70607805,Coded Welder / Fabricators,Engineering Jobs,2013-03-20 15:00:00,2013-04-19 15:00:00,ACER,contract,non-specified,Blackpool,26880.00,cv-library.co.uk
4,69750692,Events Coordinator Administration Support,"PR, Advertising & Marketing Jobs",2013-12-15 00:00:00,2014-02-13 00:00:00,AJ Chambers,permanent,non-specified,Basildon,22500.00,cv-library.co.uk
...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,"Registered General Nurse Upton, Wirral",Healthcare & Nursing Jobs,2013-12-25 00:00:00,2014-01-08 00:00:00,Time Recruitment Solutions Ltd,full_time,non-specified,Wirral,24336.00,www.jobhuntlisting.com
4996,4997,2nd line support Technician Mac specialised,IT Jobs,2012-01-15 15:00:00,2012-04-14 15:00:00,Amsys,full_time,Permanent,South East London,31500.00,www.jobhuntlisting.com
4997,4998,Maintenance Control Engineer,Engineering Jobs,2013-05-12 12:00:00,2013-06-11 12:00:00,UKStaffsearch,full_time,Permanent,Boldon Colliery,45999.96,www.jobhuntlisting.com
4998,4999,Pastry Sous Chef Top Hotel High Volume Pastr...,Hospitality & Catering Jobs,2013-11-28 15:00:00,2013-12-28 15:00:00,Chef Results,full_time,non-specified,Hertfordshire,27000.00,www.jobhuntlisting.com
4999,5000,Bilingual Technical / Remote Support engineer/...,IT Jobs,2013-04-16 00:00:00,2013-05-16 00:00:00,Global Technology Solutions Ltd,full_time,Permanent,Reading,36500.04,www.jobhuntlisting.com

### 4. Resolving data conflicts:

#### Conflict 1: Duplicates
Checking the general duplicates i.e., where all the columns are exactly the same

In [59]:
duplicates = final_df[final_df.duplicated(keep=False)] # this will show all duplicated records
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=duplicates.columns.tolist()).head(10)

There are 0 duplicate records found

Empty DataFrame
Columns: [Id, Title, Category, Open date, Close date, Company, ContractTime, ContractType, Location, Salary, Source]
Index: []

#### Conflict 2: Duplicates- a detailed approach

In [60]:
cols = ['Title','ContractTime','Source'] 
duplicates = final_df[final_df.duplicated(cols,keep=False)]
print ("There are "+ str(len(duplicates)) + " duplicate records found")
duplicates.sort_values(by=cols).head(10)

There are 2 duplicate records found

,Id,Title,Category,Open date,Close date,Company,ContractTime,ContractType,Location,Salary,Source
47717,71088642,Head of Income Services,Accounting & Finance Jobs,2013-05-23 12:00:00,2013-07-22 12:00:00,Page Personnel,permanent,non-specified,Nottingham,46500.0,jobsincredit.com
47769,69081219,Head of Income Services,Accounting & Finance Jobs,2013-05-23 12:00:00,2013-07-22 12:00:00,Page Personnel.,permanent,non-specified,Nottingham,46500.0,jobsincredit.com

In [61]:
# As all the other columns except the Id column is different, I will drop the extra row of information. 

final_df.shape

(55751, 11)

Tell me about how you fix the conflict here

In [62]:
# Code to fix the conflict- I dropped the row which has duplicate values

final_df = final_df.drop(final_df.index[47769])

# checking if only one has been dropped or not

final_df.shape

(55750, 11)

#### Finding global key for the data

In [63]:

# The global key is the 'Title','ContractTime' and 'Source'. 
# As a job listing from a particular source will only have one title and a specific contract time. These can be
# considered as a unique identifier's combination for this dataset and domain. 
# Therefore, I checked for duplicates using these global keys.

### 5. Saving the integrated and reshaped data
The last part of the integration process is to export our output data to csv format, named as:
- '\<student\_id\>_dataset_integrated.csv'

In [64]:
# saving the integrated data- using index = False as an unnamed column with an index gets added otherwise.

final_df.to_csv('s3912063_dataset_integrated.csv',index= False)

## Summary of the Assessment Task
This task taught me how to integrate two datasets smoothly. I am happy that I learnt such an important task as I am sure this will be very handy for my future job role.